In [1]:
# import libraries
import numpy as np
import pandas as pd

In [3]:
# Object creation
s = pd.Series([1, 3, 5, np, 6, 8])

In [7]:
s.dtypes

dtype('O')

In [9]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [11]:
df

                   A         B         C         D
2013-01-01  0.467066  0.130209 -0.319456 -0.784873
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-03 -0.452523  0.143867 -0.010640  0.545432
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-06  0.875075  0.065344 -0.397087  0.875058

# Dictionary

In [22]:
# In dictionary we use curly braces, key value and actual value, 
dict = {"Aammar": 1, "Bilal": 2, "Ali": 3, "Ahmed": 4, "Ahsan": 5}

In [12]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [23]:
# df2.dtypes
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [20]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [21]:
df2.align

<bound method DataFrame.align of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [24]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [26]:
df.tail()

                   A         B         C         D
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-03 -0.452523  0.143867 -0.010640  0.545432
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-06  0.875075  0.065344 -0.397087  0.875058

In [29]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df

                   A         B         C         D
2013-01-01  0.467066  0.130209 -0.319456 -0.784873
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-03 -0.452523  0.143867 -0.010640  0.545432
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-06  0.875075  0.065344 -0.397087  0.875058

In [32]:
df.to_numpy()
# This becomes 2Dim data stored in 2D array

array([[ 0.46706614,  0.13020861, -0.31945642, -0.78487341],
       [-0.49691151,  0.10775504,  0.02324064,  2.84757589],
       [-0.4525234 ,  0.14386663, -0.0106401 ,  0.54543234],
       [ 0.28026552, -0.18687364,  0.31868823, -1.30106853],
       [ 0.41299693, -0.09865848, -0.16685279, -0.3766779 ],
       [ 0.87507538,  0.06534415, -0.39708718,  0.87505833]])

In [36]:
# axis = 1 means columns, axis =0 means rows
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.875075  0.065344 -0.397087  0.875058
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-03 -0.452523  0.143867 -0.010640  0.545432
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-01  0.467066  0.130209 -0.319456 -0.784873

In [40]:
# sort values by B and C
# code is running, but its impossible to sort by 2 things. we have t osort value by 1 thing. 
df.sort_values(by=["B" , "C"])

                   A         B         C         D
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-06  0.875075  0.065344 -0.397087  0.875058
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-01  0.467066  0.130209 -0.319456 -0.784873
2013-01-03 -0.452523  0.143867 -0.010640  0.545432

In [41]:
# Why 2D array here?
# Because it includes both rows and columns


df[['A', 'B']]

                   A         B
2013-01-01  0.467066  0.130209
2013-01-02 -0.496912  0.107755
2013-01-03 -0.452523  0.143867
2013-01-04  0.280266 -0.186874
2013-01-05  0.412997 -0.098658
2013-01-06  0.875075  0.065344

In [42]:
df
# It has 4 columns(first col is index not a column), having range of 0 to 6

                   A         B         C         D
2013-01-01  0.467066  0.130209 -0.319456 -0.784873
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-03 -0.452523  0.143867 -0.010640  0.545432
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-06  0.875075  0.065344 -0.397087  0.875058

In [57]:
# To lock with indexes (0  --  n-1)
df.iloc[0:6, 0:4]

                   A         B         C         D
2013-01-01  0.467066  0.130209 -0.319456 -0.784873
2013-01-02 -0.496912  0.107755  0.023241  2.847576
2013-01-03 -0.452523  0.143867 -0.010640  0.545432
2013-01-04  0.280266 -0.186874  0.318688 -1.301069
2013-01-05  0.412997 -0.098658 -0.166853 -0.376678
2013-01-06  0.875075  0.065344 -0.397087  0.875058

In [62]:
df.loc[, [A:C]]

SyntaxError: invalid syntax (1387623055.py, line 1)

In [59]:
# give values in loc function, not indexes
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.496912  0.107755
2013-01-03 -0.452523  0.143867
2013-01-04  0.280266 -0.186874